{
	"projects": [
		{
			"title": "WorkStep",
			"slug": "workstep",
			"year": "2022–Current",
			"description": "WorkStep is enterprise HR software designed for companies with large warehouse, supply chain, and retail divisions. The software helps leaders identify ways they can improve working conditions for employees, thus leading to higher engagement and happiness in the workforce, which in turn leads to reduced turnover, and increases other important factors like productivity and safety.\r\nSince many of these employees aren’t desk workers and often have corporate emails, web-based surveys are sent out to workers’ personal contact info via text and email. Results are anonymous unless workers elect to reveal their contact info on a question-by-question basis, and the aggregated results are summarized and analyzed within the WorkStep app.\r\nAs is the case in a typical Series B startup, I wore a lot of hats and had my hands in a lot of areas in the product. I’ll take you through some highlights that I think were pretty fun and interesting.",
			"content": [
				{
					"title": "Re-architecture",
					"description": "WorkStep actually started out as a tool for sourcing candidates for frontline jobs. The software went through a lot of changes during those first several years and not all of the changes were carefully thought through. It was starting to show, and hampering product and engineering’s ability to move quickly, so the product team was approached with the task of “Making the product make sense”. I was the design lead on this project."
				},
				{
					"subtitle": "The Problem",
					"description": "An emphasis on moving fast caused features and areas to be bolted on without making adjustments to surrounding features that may have been affected, which accumulated several years worth of design and tech debt."
				},
				{
					"subtitle": "The Approach",
					"description": "The PM and myself conducted interviews and surveys with both internal stakeholders as well as customers. After creating some opportunity solution trees and better identifying some key problem areas, we worked together to fill out a product brief and get new designs going. We didn’t want to change the design so much that what was working was eliminated. But we did want to rename and move things into places that were more self-evident."
				},
				{
					"url": "../placeholder.png",
					"width": 920,
					"clear": "",
					"caption": "",
					"credits": ""
				}
			]
		},
		{
			"title": "Unilease",
			"slug": "unilease",
			"year": "2021–2022",
			"description": "Commercial real estate is an industry slow to adopt new ways of doing things. Brokers who are doing well for themselves have little incentive to change things, large firms even less so, and tenants are at the mercy of these gatekeepers’ well-established processes. Unilease was created by a commercial real estate broker in central Texas to streamline the way he did business, making it easier for both brokers and tenants. I was brought in to help establish a design system, improve the existing user experience, and expand the toolset Unilease offered with the intent of it becoming a product available to all brokers and brokerages.",
			"content": [
				{
					"url":"comp.png",
					"width":"920",
					"clear":"false"
				},
				{
					"url":"sign.png",
					"width":"327",
					"clear":"false"
				},
				{
					"url":"t-shirt.png",
					"width":"327",
					"clear":"false"
				}
			]
		},
		{
			"title": "Halliburton",
			"slug": "halliburton",
			"year": "2020–2021",
			"description": "The goal of Halliburton's 2020 website redesign was to not only bring them into the 21st century, but give them a look and feel that rivaled competitors such as Schlumberger. We built an elaborate system of prefab components, content guidelines, and a backend that allowed the company to make changes as needed.",
			"content": [
				{
					"url": "../placeholder.png",
					"width": 920,
					"clear": "",
					"caption": "",
					"credits": ""
				}
			]
		},
		{
			"title": "Hallmark",
			"slug": "hallmark",
			"year": "2019–2020",
			"description": "My first client at T3 was Hallmark, who were a joy to work with. Our engagement lasted over a year, so I was involved in a variety of initiatives: coordinating with other designers on establishing a new design system; designing the main navigation; collaborating with Hallmark's internal stakeholders on how the new site's registration would work with Hallmark's Crown Rewards program; and desiging the product details page (PDP) to name the big ones.",
			"content": [
				{
					"url":"../placeholder.png",
					"width":"0",
					"clear":"false",
					"caption":"The finished PDP. Hallmark saw an enormous increase in card sales after the launch of this new PDP, although it was during the 2020 COVID-19 pandemic and folks wanting to reach out to each other from afar was no doubt partly responsible. "
				},
				{
					"url":"../placeholder.png",
					"width":"0",
					"clear":"true",
					"caption":"Flowchart detailing sign up behavior. Hallmark's leadership wanted user registration to automatically assign a rewards account to any new user signing up. But because customers could enroll in the rewards program at a physical Hallmark store without providing an email address, we wanted to afford the ability to link an existing rewards program account during account registration. Similar functionality existed in the account area, but we knew resolving it here would reduce support call volume to Hallmark."
				},
				{
					"url":"../placeholder.png",
					"width":"0",
					"clear":"true",
					"caption":"Some examples from the design system's documentation."
				}
			]
		},		
		{
			"title": "EverlyWell",
			"slug": "everlywell",
			"year": "2018–2019",
			"description": "EverlyWell sells at-home lab testing kits for things such as thyroid, vitamins, STD, and food sensitivities. After a user collects their sample and mails it in, EverlyWell helps make sense of the results. When I joined, it had just raised its series A and had a staff of about 25 people. I stayed 18 months, and during that time it raised its series B, launched two major versions of its results platform, tripled in staff, and began offering several additional tests.",
			"content": [
				{
					"url":"UIKit.png",
					"width":"1440",
					"clear":"false"
				},
				{
					"url":"Results.jpg",
					"width":"1440",
					"clear":"false",
					"caption":"There was a running joke that time spent at EverlyWell was like dog years, because everyone did a lot in a small amount of time. EverlyWell’s branding was purchased through Fiverr, and the marketing site when I arrived had been designed by Funsize. A lot of talented people helped create the 2019 design for the results platform, including <a href=\"https://www.anna-ho.com/\" target=\"_blank\">Anna Ho</a>, <a href=\"http://williamfikes.com/\" target=\"_blank\">Will Fikes</a>, and <a href=\"http://www.ericbog.gs\" target=\"_blank\">Eric Boggs</a>."
				},
				{
					"url":"SciencePage.jpg",
					"width":"1350",
					"clear":"false",
					"caption":"When the 2019 Theranos documentary was about to be released on HBO, EverlyWell’s leaders were working hard to close series B funding. The website had only cursory information about the science behind EverlyWell’s tests, and it wasn’t easy to find. With only a week’s turnaround, we planned, designed, wrangled content for, and published a brand new science section prominently featured in the main navigation."
				},
				{
					"url":"ContentBlocks.png",
					"width":"800",
					"clear":"false",
					"caption":"EverlyWell’s results platform had a “one-size-fits-all” approach to 30 different tests, and consistently we heard that users’ results didn’t feel very personalized or actionable. Using low fidelity wireframes, I created a modular content system to outline the different blocks of content we’d show, and when. For example, if a user had taken the same test six times and their latest results were normal, we wouldn’t show the same content as a brand new user who had abnormal results. This was a page from a document intended to get buy-in from stakeholders on what these blocks were, what order we’d show them, and in what phase we’d roll them out."
				},
				{
					"url":"ADA-Color-Wheel.svg",
					"width":"800",
					"clear":"false",
					"caption":"EverlyWell had a lot of fragmentation when it came to color. There were two or three blues used for button colors, and three or four different greens used throughout the site. To make matters worse, one of our frontend engineers was colorblind, and it was really difficult for him to notice the differences. Additionally the entire company was wanting to become more ADA compliant, and we really didn’t have any internal guidelines on how that would translate to our work. I followed Lyft’s lead and used their <a href=“http://colorbox.io/“ target=“_blank”>color tool</a> to create a systematic color scheme. Black text was compliant on the 6 inner rings, and white text was compliant on the 6 outer rings. We didn’t use more than a handful of the colors, but it gave us room to grow if we needed. It was much easier to tell the devs to use “Blue 4” instead of “The same one we use for button colors”. Plus since all the colors were variables in the code, it paved the way to more smoothly roll out future branding."
				}
			]
		},
		{
			"title": "Insitome",
			"slug": "insitome",
			"year": "2017–2018",
			"role":"Lead Designer",
			"content": [
				{
					"type":"paragraph",
					"copy":"Insitome (pronounced “insight-oam”) was a company partnered with DNA testing platform, Helix. Similar to 23andMe, Helix sequenced people’s DNA via mail-in saliva samples, but what made them different was providing the data to third-party app developers in a “marketplace”. The idea was for Helix to create a sort-of app store where people making the apps could leverage the DNA you had on file with Helix."
				},
				{
					"type":"paragraph",
					"copy":"Insitome was one of these creators, and sold separate edutainment modules that used DNA to shed light on people’s various traits."
				},
				{
					"url":"Neanderhtal_Insight@2x.jpg",
					"width":"420",
					"clear":"false"
				},
				{
					"url":"Metabolism_Trait-Top@2x.jpg",
					"width":"420",
					"clear":"false"
				},
				{
					"url":"Regional-Ancestry_Dashboard@2x.jpg",
					"width":"420",
					"clear":"false"
				},
				{
					"url":"Regional-Ancestry_Subregion@2x.jpg",
					"width":"420",
					"clear":"false"
				},
				{
					"url":"Metabolism_Trait-Infographics@2x.jpg",
					"width":"420",
					"clear":"false",
					"caption":"With branding and packaging created by Lindsay Gravette at Elbow, and one product (Neanderthal) already in the wild, my primary job was to help launch two sister products, Metabolism and Regional Ancestry. I also designed an updated marketing website, helped launch a podcast, helped plan content for the products, created a full-page print ad, and did some motion graphics work."
				},
				{
					"url":"OnboardingFlow@2x.png",
					"width":"1047",
					"clear":"true",
					"caption":"Helix acting as a middleman between the apps on its marketplace and the end-user created a lot of interesting challenges from an onboarding perspective. The existing onboarding had several steps, many of which weren’t skippable. One of my first tasks was to come up with recommendations to simplify."
				},
				{
					"url":"responsive@2x.jpg",
					"width":"920",
					"clear":"true",
					"caption":"Another added challenge was that there were two versions of each app being developed in parallel: an iOS version, and a responsive web version. (This was a contractual obligation with Helix.) Since I had never worked alongside an iOS developer before, I was grateful to have someone who helped me understand the nuances of layout in iOS and how they differed from web, which is what I was used to."
				},
				{
					"url":"migration.gif",
					"width":"750",
					"clear":"true"
				},
				{
					"url":"WorldMap@2x.png",
					"width":"1440",
					"clear":"true",
					"border":"true",
					"caption":"Maps were a big part of Insitome. Sitting alongside the director of science content, I acted as a pair of hands to get the regions and migration paths in the right places with the right amount of overlap."
				},
				{
					"url":"GenomeAdSketches@2x.png",
					"width":"732",
					"clear":"true"
				},
				{
					"url":"Genome-Ad-Layout@2x.jpg",
					"width":"920",
					"clear":"true",
					"caption":"After launching the Metabolism and Regional Ancestry products, I helped create an ad for Genome magazine. Several rough concept sketches were presented, and the CEO fell in love with the idea of a decoder ring because he thought it would strike a nostalgia chord with the magazine’s audience. I styled and directed the shot, retouched the photos, layed out the ad, and coordinated with Helix’s legal team and Genome magazine."
				},
				{
					"url":"Marketing-Site@2x.jpg",
					"width":"1440",
					"clear":"true",
					"caption":"After the holidays were over, I helped design a new marketing site. Before construction was complete, Insitome parted ways with its product and engineering staff to put the company in maintenance mode. But before that happened, I created a prototype of the desktop site which you can see <a href=\"https://framer.cloud/itJps/\" target=\"_blank\">here</a>."
				}
			]
		},
		{
			"title": "SXSW Music Blogger's Guide",
			"slug": "sxsw",
			"year": "2017",
			"role": "Lead UX Designer",
			"content": [
				{
					"type":"image",
					"url":"01-landing.jpg"
				},
				{
					"type":"paragraph",
					"copy":"Each year, Music / Film / Interactive festival SXSW (South by Southwest) likes to highlight some of the lesser-known artists who will be performing. So they invite bloggers and music journalists from around the world to pick any artist on the upcoming SXSW schedule, and write a paragraph about them. 2017 was the first year they moved the guide to the web, and my role as the lead UX designer involved project scoping, persona creation, leading internal workshops, and acting as a liaison between UI, UX, and dev."
				},				
				{
					"type":"h2",
					"copy":"Process"
				},				
				{
					"type":"image",
					"url":"07-persona.jpg"
				},
				{
					"type":"paragraph",
					"copy":"The personas we created were provisional in nature. While we didn’t identify festival goers and interview them, we had a lot of friends who attended the festival and as music lovers ourselves were solving problems we knew we and other attendees would face. "
				},
				{
					"type":"image",
					"url":"06-wires.jpg"
				},
				{
					"type":"paragraph",
					"copy":"The team created rough wireframe sketches separately, then came together as a group to share ideas and evaluate. The stickies were us organizing our thoughts on common elements we were seeing across everyone's ideas."
				},
				{
					"type":"paragraph",
					"copy":"One tricky aspect about this project was that it was to be a completely separate entity from the official SXSW website, and this meant that utilizing schedule info was a non-starter. Early concepts had ideas around a mobile experience that would highlight bands in real-time based on a person’s location.” You’re at the Fader Fort seeing Danny Brown. Earl Sweatshirt will be playing 2 blocks away in 30 minutes, here’s what MXDWN has to say about him.” If the goal of the blogger’s guide was to expose bands, this would be a great way to do it."
				},
				{
					"type":"paragraph",
					"copy":"Another initial idea included the ability for users to make and share playlists of their favorite artists in the guide. But for business reasons, we shelved the idea for another time. We also had loftier ideas for names (I was lobbying for Under the Radar) but due to the naming system for SXSW’s tightly managed brand, were forced to keep it simple and straightforward. The final structure of the site was fairly simple."
				},
				{
					"type":"image",
					"url":"08-flowchart.jpg"
				},
				{
					"type":"image",
					"url":"artist-details-wire.png"
				},
				{
					"type":"h2",
					"copy":"Outcome"
				},							
				{
					"type":"paragraph",
					"copy":"Unfortunately I don’t have any metrics on how the site was used, how much traffic it got, or whether it led to more business for Foxtrot who was doing the site at a discount in return for a credit on the site. But it’s a project I learned a lot from, and am happy with the results. Credit for the final UI goes to <a href=\"https://greganthonythomas.com\" target=\"_blank\">Greg Anthony Thomas</a> and <a href=\"https://oscarmorris.design\">Oscar Morris</a>."
				},
				{
					"url":"02-browse.jpg",
					"clear":"true"
				},
				{
					"url":"03-artist.jpg",
					"clear":"true"
				},
				{
					"url":"04-directory.jpg",
					"clear":"true"
				},
				{
					"url":"05-mbg-phone.jpg",
					"clear":"true"
				}
			]
		},
		{
			"title": "Dimensional",
			"slug": "dfa",
			"year": "2016",
			"role": "Lead UX Designer",
			"content": [
				{
					"type": "image",
					"url":"01-home-d.jpg"
				},
				{
					"type": "paragraph",
					"copy": "Dimensional Fund Advisors is an investment firm based in Austin that stands apart from the usual Wall Street suspects. Founded on academic research rather than market predictions, DFA takes a refreshingly different approach to managing money. While most investment firms are busy trying to time the market or pick winning stocks, Dimensional focuses on capturing returns through scientifically-tested factors that drive performance over time."
				},
				{
					"type":"h2",
					"copy":"Process"
				},
				{
					"type": "paragraph",
					"copy": "This project was similar to the Austin Film Society site redesign, but on a smaller website and with fewer stakeholders. The client being an investment firm instead of a non-profit film collective led to differences in the tone of both the design and the level of rigor that went into the design and specs, plus the content was a lot more dense."
				},
				{
					"type": "paragraph",
					"copy": "I was involved in early UI concepting, UX design, and production on the deliverables as well as some interfacing with the offshore developers on the project. There were about 10 different templates comprising 16 different content components."
				},
				{
					"type": "image",
					"url":"04-phone.jpg"
				},
				{
					"type": "image",
					"url":"02-lowfi-wires.jpg"
				},
				{
					"type": "paragraph",
					"copy": "Pages were structured using a series of reusable building blocks so that the client could mix and match to make new pages as necessary, even after our contract with them ended. We created low fidelity wireframes to illustrate which blocks would be used where. Each component had its own documentation to show how it operated. This is the page for the primary nav bar."
				},
				{
					"type": "image",
					"url":"03-highfi-wires.png"
				},
				{
					"type": "image",
					"url":"dfa-home-wires.png"
				},
				{
					"type": "paragraph",
					"copy": "These are some of the wireframe annotations detailing the different components within the pages, our taxonomy for them, and how they should function."
				},
				{
					"type": "image",
					"url":"../placeholder.png"
				},
				{
					"type": "paragraph",
					"copy": "During the UI concepting phase, this was a homepage scrollytelling style animation I had been toying around with."
				}
			]
		},
		{
			"title": "Austin Film Society",
			"slug": "afs",
			"year": "2016",
			"role": "Lead UX Designer",
			"tags": ["Agency", "Sketch", "Photoshop", "InDesign", "Website", "User Experience", "User Interface", "Content Design", "Information Architecture", "Content Audit", "Sitemap", "Wireframes"],
			"content": [
				{
					"type":"image",
					"url":"01-homed.jpg"
				},
				{
					"type":"paragraph",
					"copy":"Nearly 10 years ago when I worked at Foxtrot, I was beyond excited that I got to be the lead UX designer on the revamped Austin Film Society website. The old site was pretty confusing and difficult to navigate, and because AFS does so many different things which are managed by so many different stakeholders, my role was mainly to work with these stakeholders to untangle the information architecture and ensure the most prominent areas of their site matched the prominence of the organization’s goals."
				},
				{
					"type":"paragraph",
					"copy":"The people at the organization were terrific to work with, as was Oscar Morris who collaborated with me on the UI and did their terrific branding. The branding and site launch coincided with AFS opening AFS Cinema. While I have no quant or qual data on the success of the site, they’re still <a href=\"https://www.austinfilm.org\" target=\"_blank\">using the same design</a> (as of March 2025), and AFS Cinema remains Austin’s only nonprofit art house theater. "
				},
				{
					"type":"h2",
					"copy":"Process"
				},
				{
					"type":"paragraph",
					"copy":"The first big piece of the puzzle was a content audit, which involved mapping out the existing site and logging every “chunk” of UI and content on every page. Everything was logged into a spreadsheet, and meetings were held with the appropriate stakeholders to figure out what needed to stay and what could go, as well as who was responsible for keeping which piece updated. This was my first time doing a real content audit and working on an information architecture of this size, so I learned a lot, and when doing a project like this, I still use similar methods today."
				},
				{
					"type":"image",
					"url":"03-content-mapping.jpg"
				},
				{
					"type":"paragraph",
					"copy":"Dev resources were limited, so bearing that in mind and wanting to maintain consistency across the site we came up with several reusable content modules. As I was going through the audit, I identified similarities where pieces of content could use the same module. This also helped us define how many times any given module was being used."
				},
				{
					"type":"image",
					"url":"05-sitemap.png"
				},
				{
					"type":"paragraph",
					"copy":"A sitemap was put together with a hierarchy that made more sense, and the content modules were color-coded and organized so we could try to highlight similarities between pages. We realized the majority of pages were pretty basic content and could be handled by a few common page templates."
				},
				{
					"type":"image",
					"url":"content-framework.png"
				},
				{
					"type":"image",
					"url":"04-recipes.jpg"
				},
				{
					"type":"image",
					"url":"common-wires.png"
				},
				{
					"type":"paragraph",
					"copy":"For the remaining pages, we identified some common user goals and how they’d be accomplished coming from different sources. "
				},
				{
					"type":"image",
					"url":"buying-ticket-user-flow.png"
				},
				{
					"type":"paragraph",
					"copy":"By this point we were getting into wireframe territory to identify exactly how on the more complex pages users would accomplish their goals such as buying tickets to see a movie, donating, or signing up for classes. This was where mine and Oscar’s work began to overlap the most and where the site finally started to take shape."
				},
				{
					"type":"image",
					"url":"screening-x-ux.png",
					"width":"half"
				},
				{
					"type":"image",
					"url":"screening-x-ui.jpg",
					"width":"half"
				},
				{
					"type":"paragraph",
					"copy":"The last detail I’ll leave you with is that the sitemap was originally manually created using Adobe Illustrator, which at the time didn’t have any kind of automatic layout capabilities. The manual nature of making small changes became pretty tedious, so I coded <a href=\"https://lab.waltercoots.com/taxonomy/\" target=\"_blank\">a tool</a> to do it in a web browser. I’ve reused this tool over the years and often daydream of making a web content planning tool to simplify a lot of what I did on this project, because it’s very much a collaborative process that could benefit from having a robust, dedicated tool. "
				}
			]
		},
		{
			"title": "Misc.",
			"slug": "misc",
			"year": "",
			"description": "Some things that don't warrant an individual spot, but that I can't bring myself to leave out.",
			"content": [
				{
					"url":"growing-pains.jpg",
					"clear":"true",
					"caption":"This was an art piece I created for a friend around 2007 or 2008. It's made entirely from materials I purchased at the hardware store - PVC pipe, clamps, screws, fence planks, and paints."
				},
				{
					"url":"rr_02.jpg",
					"clear":"true",
					"caption":"Packaging design from my days in school. I really love being able to think three-dimensionally and work with physical objects."
				},
				{
					"url":"shrew.jpg",
					"caption":"This is another school project I can't stop putting in my portfolio because I had so much fun with it. I hardly ever get to do lettering, but when I do, I have a blast.",
					"clear":"true"
				},
				{
					"url":"tamed.jpg",
					"clear":"true"
				}
			]
		}
	]
}